In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r"C:\Downloads\marksheet.csv")

In [3]:
df

   S.No Gender   Data Science    WT     AI
0     1       M          23.0  66.0    NaN
1     2       F          56.0  56.0   65.0
2     3       M          64.0  56.0  123.0
3     4       F           NaN  65.0   51.0
4     5       M          64.0   NaN   51.0
5     6       F          64.0   NaN   51.0
6     7       M           NaN  64.0   85.0
7     8       F          44.0  55.0   35.0
8     9       M          46.0  35.0    NaN
9    10       F          54.0  64.0   68.0

In [5]:
df['AI'].unique()

array([ nan,  65., 123.,  51.,  85.,  35.,  68.])

In [6]:
df['WT'].unique()

array([66., 56., 65., nan, 64., 55., 35.])

In [7]:
t=df[df['WT']=="56.0"]
t

Empty DataFrame
Columns: [S.No, Gender , Data Science, WT, AI]
Index: []

In [8]:
print("standard of the all subject",np.std(t))

standard of the all subject S.No            NaN
Gender          NaN
Data Science    NaN
WT              NaN
AI              NaN
dtype: object

In [9]:
print("minimum of all the marks")
np.min(t)

minimum of all the marks

C:\Users\Abhishek Khot\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:84: FutureWarning: In a future version, DataFrame.min(axis=None) will return a scalar min over the entire DataFrame. To retain the old behavior, use 'frame.min(axis=0)' or just 'frame.min()'
  return reduction(axis=axis, out=out, **passkwargs)

S.No            NaN
Gender          NaN
Data Science    NaN
WT              NaN
AI              NaN
dtype: object

In [10]:
print("maximum of all the marks")
np.max(t)

maximum of all the marks

C:\Users\Abhishek Khot\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:84: FutureWarning: In a future version, DataFrame.max(axis=None) will return a scalar max over the entire DataFrame. To retain the old behavior, use 'frame.max(axis=0)' or just 'frame.max()'
  return reduction(axis=axis, out=out, **passkwargs)

S.No            NaN
Gender          NaN
Data Science    NaN
WT              NaN
AI              NaN
dtype: object

In [12]:
import statistics
print("Median marks in subject AI are",statistics.median(df['AI']))

Median marks in subject AI are 58.0

In [13]:
print("Median marks in subject WT are",statistics.median(df['WT']))

Median marks in subject WT are 64.5

In [14]:
df.describe()

           S.No  Data Science         WT         AI
count  10.00000      8.000000   8.000000    8.00000
mean    5.50000     51.875000  57.625000   66.12500
std     3.02765     14.106103  10.211163   27.38841
min     1.00000     23.000000  35.000000   35.00000
25%     3.25000     45.500000  55.750000   51.00000
50%     5.50000     55.000000  60.000000   58.00000
75%     7.75000     64.000000  64.250000   72.25000
max    10.00000     64.000000  66.000000  123.00000